tap "nikitabobko/tap"
tap "felixkratz/formulae"
tap "oven-sh/bun"
tap "anomalyco/tap"
tap "derailed/k9s"

# command-line tools
brew "fzf"
brew "gh"
brew "jq"
brew "ripgrep"
brew "trash"
brew "tree"
brew "entr"
brew "zoxide"
brew "fd"
brew "bat"
brew "felixkratz/formulae/borders"

# terminal apps
brew "neovim"
brew "tmux"
brew "pgcli"
brew "yazi"
brew "btop"
brew "serie"
brew "anomalyco/tap/opencode"

### Notes
# `serie`: git-commit graph. could be useful
# `posting`: good candidate for http client adoption
# `resterm`: for inspiration/reference since it uses a text-based request builder
# `harlequin`: decent sql-client, not sure how to navigate it but worth trying
# `phantom`: support git-worktres and tmux but windows/panes-based, not sessions

# dev
brew "stylua"
brew "tree-sitter-cli"
brew "erlang"
brew "elixir"
brew "oven-sh/bun/bun"

# package managers
brew "asdf"
brew "fisher"

# containers
brew "docker"
brew "colima"
brew "kubectl"
brew "derailed/k9s/k9s"

# fonts
cask "font-jetbrains-mono"

# apps
cask "wezterm"
cask "spotify"
cask "raycast"
cask "appcleaner"
cask "google-chrome"
cask "homerow"
cask "bruno"
cask "nikitabobko/tap/aerospace"
